build: modernize project toolchain
